<template><h3 id="队列"><a class="header-anchor" href="#队列">#</a> 队列</h3>
<p>一种操作受限的线性表数据结构。先进者先出，这就是典型的“队列”。</p>
<p>最基本的操作也是两个：入队 enqueue()，放一个数据到队列尾部；出队 dequeue()，从队列头部取一个元素。</p>
<p><img src="$%7Bimages%7D/68747470733a2f2f75706c6f61642e77696b696d656469612e6f72672f77696b6970656469612f636f6d6d6f6e732f352f35322f446174615f51756575652e737667.svg" alt="68747470733a2f2f75706c6f61642e77696b696d656469612e6f72672f77696b6970656469612f636f6d6d6f6e732f352f35322f446174615f51756575652e737667"></p>
<p>用数组实现的队列叫作顺序队列，用链表实现的队列叫作链式队列。</p>
<p>队列需要两个指针：一个是 head 指针，指向队头；一个是 tail 指针，指向队尾。</p>
<h4 id="循环队列"><a class="header-anchor" href="#循环队列">#</a> 循环队列</h4>
<p>要想写出没有 bug 的循环队列实现代码，关键要确定好队空和队满的判定条件，具体的代码你要能写出来。</p>
<img src="${images}/3d81a44f8c42b3ceee55605f9aeedcec.jpg" alt="img" style="zoom:50%;" />
<p>队满：(tail+1)%n=head</p>
<p>队空：tail==head</p>
<h3 id="应用场景"><a class="header-anchor" href="#应用场景">#</a> 应用场景</h3>
<ul>
<li>
<p>队列在线程池等有限资源池中的应用</p>
<p>对于大部分资源有限的场景，当没有空闲资源时，基本上都可以通过“队列”这种数据结构来实现请求排队。</p>
</li>
</ul>
</template>