<template><p>TCP/IP 协议是一个“有层次的协议栈”， HTTP 协议位于 TCP/IP 协议的应用层。</p>
<p>TCP/IP 协议栈</p>
<img src="${images}/2b8fee82b58cc8da88c74a33f2146703.png" alt="img" style="zoom: 50%;" />
<ol>
<li>链接层（link layer）
<ul>
<li>负责在以太网、WiFi 这样的底层网络上发送原始数据包</li>
<li>通过 MAC 地址来寻找网络上的设备</li>
</ul>
</li>
<li>网络层（internet layer）
<ul>
<li>通过 IP 地址寻找局域网</li>
</ul>
</li>
<li>传输层（transport layer）
<ul>
<li>TCP 是一个有状态的协议，需要先与对方建立连接然后才能发送数据，而且保证数据不丢失不重复。</li>
<li>TCP 的数据是连续的“字节流”，有先后顺序，而 UDP 则是分散的小数据包，是顺序发，乱序收。</li>
</ul>
</li>
<li>应用层（application layer）</li>
</ol>
<p>OSI 协议栈（Open System Interconnection Reference Model）</p>
<p>仅仅只是提供标准<strong>参考</strong>的协议栈，毕竟 TCP/IP 等协议先已经在许多网络上实际运行，再推翻重来是不可能的。所以，OSI 分层模型在发布的时候就明确地表明是一个“参考”，不是强制标准。但日常交流的时候我们通常使用 OSI 模型，用四层、七层等术语。</p>
<p><img src="$%7Bimages%7D/3abcf1462621ff86758a8d9571c07cdc.png" alt="img"></p>
<ol>
<li>第一层：物理层，网络的物理形式，例如电缆、光纤、网卡、集线器等等；</li>
<li>第二层：数据链路层，它基本相当于 TCP/IP 的链接层；</li>
<li>第三层：网络层，相当于 TCP/IP 里的网际层；</li>
<li>第四层：传输层，相当于 TCP/IP 里的传输层；</li>
<li>第五层：会话层，维护网络中的连接状态，即保持会话和同步；</li>
<li>第六层：表示层，把数据转换为合适、可理解的语法和语义；</li>
<li>第七层：应用层，面向具体的应用传输数据。</li>
</ol>
<p>所谓的“四层负载均衡”就是指工作在传输层上，基于 TCP/IP 协议的特性，例如 IP 地址、端口号等实现对后端服务器的负载均衡。</p>
<p>所谓的“七层负载均衡”就是指工作在应用层上，看到的是 HTTP 协议，解析 HTTP 报文里的 URI、主机名、资源类型等数据，再用适当的策略转发给后端服务器。</p>
<p>二层转发：设备工作在链路层，帧在经过交换机设备时，检查帧的头部信息，拿到目标mac地址，进行本地转发和广播</p>
<p>三层路由：设备工作在ip层，报文经过有路由功能的设备时，设备分析报文中的头部信息，拿到ip地址，根据网段范围，进行本地转发或选择下一个网关</p>
</template>